str1 = "Oct: \051\052\053"
str2 = "Hex: \x31\x32\x33\x78\x79\x7A"
print(str1)
print(str2)


# int(x)	将 x 转换成整数类型
# float(x)	将 x 转换成浮点数类型
# complex(real，[,imag])	创建一个复数
# str(x)	将 x 转换为字符串
# repr(x)	将 x 转换为表达式字符串
# eval(str)	计算在字符串中的有效 Python 表达式，并返回一个对象
# chr(x)	将整数 x 转换为一个字符
# ord(x)	将一个字符 x 转换为它对应的整数值
# hex(x)	将一个整数 x 转换为一个十六进制字符串
# oct(x)	将一个整数 x 转换为一个八进制的字符串



# +	加	12.45 + 15	27.45
# -	减	4.56 - 0.26	4.3
# *	乘	5 * 3.6	18.0
# /	除法（和数学中的规则一样）	7 / 2	3.5
# //	整除（只保留商的整数部分）	7 // 2	3
# %	取余，即返回除法的余数	7 % 2	1
# **	幂运算/次方运算，即返回 x 的 y 次方	2 ** 4	16，即 2^4